# ðŸ““Pandas_nulos

In [1]:
import pandas as pd
pd.__version__

'2.3.2'

## DataFrame de pruebas

In [31]:
data = {
    "Cliente": ["Ana", "Luis", "Ana", "Carlos", "Luis", "Marta", None],
    "Edad": [25, None, 25, 40, 33, None, 22],
    "Ciudad": ["CDMX", "Monterrey", "CDMX", None, "GDL", "GDL", "CDMX"],
    "Compras_mensuales": [5, 3, 5, None, 2, 4, None]
}

df = pd.DataFrame(data)
df

  Cliente  Edad     Ciudad  Compras_mensuales
0     Ana  25.0       CDMX                5.0
1    Luis   NaN  Monterrey                3.0
2     Ana  25.0       CDMX                5.0
3  Carlos  40.0       None                NaN
4    Luis  33.0        GDL                2.0
5   Marta   NaN        GDL                4.0
6    None  22.0       CDMX                NaN

## Identificar valores nulos

In [32]:
df.isnull().sum()

Cliente              1
Edad                 2
Ciudad               1
Compras_mensuales    2
dtype: int64

In [36]:
df.isnull()

   Cliente   Edad  Ciudad  Compras_mensuales
0    False  False   False              False
1    False   True   False              False
2    False  False   False              False
3    False  False    True               True
4    False  False   False              False
5    False   True   False              False
6     True  False   False               True

## ImputaciÃ³n de valores nulos

### Imputacion con media

In [40]:
media_compras = df["Compras_mensuales"].mean()
df["Compras_mensuales_media"] = df["Compras_mensuales"].fillna(media_compras)
df

  Cliente  Edad     Ciudad  Compras_mensuales  Compras_mensuales_media
0     Ana  25.0       CDMX                5.0                      5.0
1    Luis   NaN  Monterrey                3.0                      3.0
2     Ana  25.0       CDMX                5.0                      5.0
3  Carlos  40.0       None                NaN                      3.8
4    Luis  33.0        GDL                2.0                      2.0
5   Marta   NaN        GDL                4.0                      4.0
6    None  22.0       CDMX                NaN                      3.8

### Imputacion con mediana

In [43]:
#Aplicamos sobre columna numerica: edad
mediana_edad = df["Edad"].median()
df["Edad_mediana"] = df["Edad"].fillna(mediana_edad)
df

,Cliente,Edad,Ciudad,Compras_mensuales,Compras_mensuales_media,Edad_mediana
0,Ana,25.0,CDMX,5.0,5.0,25.0
1,Luis,NaN,Monterrey,3.0,3.0,25.0
2,Ana,25.0,CDMX,5.0,5.0,25.0
3,Carlos,40.0,None,NaN,3.8,40.0
4,Luis,33.0,GDL,2.0,2.0,33.0
5,Marta,NaN,GDL,4.0,4.0,25.0
6,None,22.0,CDMX,NaN,3.8,22.0

### ImputaciÃ³n con valor fijo

In [44]:
df["Ciudad_fija"] = df["Ciudad"].fillna("Desconocida")
df

,Cliente,Edad,Ciudad,Compras_mensuales,Compras_mensuales_media,Edad_mediana,Ciudad_fija
0,Ana,25.0,CDMX,5.0,5.0,25.0,CDMX
1,Luis,NaN,Monterrey,3.0,3.0,25.0,Monterrey
2,Ana,25.0,CDMX,5.0,5.0,25.0,CDMX
3,Carlos,40.0,None,NaN,3.8,40.0,Desconocida
4,Luis,33.0,GDL,2.0,2.0,33.0,GDL
5,Marta,NaN,GDL,4.0,4.0,25.0,GDL
6,None,22.0,CDMX,NaN,3.8,22.0,CDMX

In [46]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [48]:
df.duplicated().sum()

np.int64(1)

In [49]:
df_sin_duplicados= df.drop_duplicates()

In [52]:
df_sin_duplicados

,Cliente,Edad,Ciudad,Compras_mensuales,Compras_mensuales_media,Edad_mediana,Ciudad_fija
0,Ana,25.0,CDMX,5.0,5.0,25.0,CDMX
1,Luis,NaN,Monterrey,3.0,3.0,25.0,Monterrey
3,Carlos,40.0,None,NaN,3.8,40.0,Desconocida
4,Luis,33.0,GDL,2.0,2.0,33.0,GDL
5,Marta,NaN,GDL,4.0,4.0,25.0,GDL
6,None,22.0,CDMX,NaN,3.8,22.0,CDMX